---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalPhase
source: html/aff8cc61-d006-c2df-8687-86c41f219384.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalPhase

An enumerated type to specify whether the electrical system is single phase or three phase.

## Syntax (C#)
```csharp
public enum ElectricalPhase
```